<?php

/**
* 
* 作者：猴子
* 声明：后台设置:后台管理方面的设置
* 此配置文件为自动生成，生成时间2021-12-29 10:43:50
*/

return [
    //基本设置:后台的基本信息设置
    'base'=>[
    //后台名称
    'name'=>'纵歌长安',
    //后台简称
    'short_name'=>'代理系统',
    //后台作者
    'author'=>'1',
    //后台版本
    'version'=>'1.2',
],
    //登录设置:后台登录相关设置
    'login'=>[
    //登录token验证
    'token'=>'0',
    //验证码
    'captcha'=>'0',
    //登录背景
    'background'=>'/uploads/attachment/20211229/fdeff6374aeec857f701d3bc22830b14.jpg',
],
    //首页设置:后台首页参数设置
    'index'=>[
    //默认密码警告
    'password_warning'=>'1',
    //是否显示提示信息
    'show_notice'=>'1',
    //提示信息内容
    'notice_content'=>'系统提现周期T+1,有任何问题欢迎联系管理员QQ：50728922',
    //管理员QQ
    'admin_qq'=>'50728922',
    //代理公告提示信息
    'agent_notice'=>'系统提现周期T+1,有任何问题欢迎联系管理员QQ：50728922',
],
];