<?php
// +----------------------------------------------------------------------
// | 作者：修缘    联系QQ：278896498   QQ群：1054861244
// | 声明：未经作者许可，禁止倒卖等商业运营，违者必究
// +----------------------------------------------------------------------
// | 创建时间:2020/2/22 21:47
// +----------------------------------------------------------------------

return [
    'list' => [
        1 => [
            'id' => 1,'name' => '游戏管理员','desc' => '负责管理游戏内各种违规现象','type' => 0,
        ],
        2 => [
            'id' => 20,'name' => '天人合一','desc' => '天与地合，人与天合','type' => 0,
        ],

        3 => [
            'id' => 29,'name' => '驰骋江湖','desc' => '驰骋江湖，快意恩仇','type' => 0,
        ],
        4 => [
            'id' => 30,'name' => '马到成功','desc' => '马都到了，事能不成吗？','type' => 0,
        ],
        5 => [
            'id' => 43,'name' => '财大气粗','desc' => '有钱，说话就是硬气','type' => 0,
        ],
	    6 => [
            'id' => 44,'name' => '超群绝伦','desc' => '人群中你最亮眼','type' => 0,
        ],
        7 => [
            'id' => 46,'name' => '丰功伟绩','desc' => '前无古人，后无来者','type' => 0,
        ],
	    8 => [
            'id' => 47,'name' => '富甲天下','desc' => '天底下最有钱的人','type' => 0,
        ],
	    9 => [
            'id' => 56,'name' => '武林高手','desc' => '武林中已经有你这号人了','type' => 0,
        ],
        10 => [
            'id' => 57,'name' => '武林奇才','desc' => '骨骼惊奇，练武奇才','type' => 0,
        ],
        11 => [
            'id' => 58,'name' => '武林英杰','desc' => '天下武林，英雄豪杰','type' => 0,
        ],
	    12 => [
            'id' => 59,'name' => '武林至尊','desc' => '武林上下，唯吾独尊','type' => 0,
        ],
        13 => [
            'id' => 60,'name' => '武林宗师','desc' => '武林中，德高望重，人人敬仰','type' => 0,
        ],
	    14 => [
            'id' => 65,'name' => '三界豪杰','desc' => '三界之内，英雄豪杰','type' => 0,
        ],
	    15 => [
            'id' => 78,'name' => '三界首善','desc' => '三界之内的大善人','type' => 0,
        ],
        16 => [
            'id' => 86,'name' => '水陆战神','desc' => '水陆大会的不败战神','type' => 0,
        ],
	    17 => [
            'id' => 96,'name' => '天地英雄','desc' => '天地之间，汝为英雄','type' => 0,
        ],
	    18 => [
            'id' => 200,'name' => '夫妻','desc' => '夫妻搭配，干活不累','type' => 3,
        ],
        19 => [
            'id' => 201,'name' => '结拜','desc' => '打架，拼的就是人多','type' => 2,
        ],
        20 => [
            'id' => 221,'name' => '帮众','desc' => '小虾米，只能打酱油','type' => 1,
        ],
        21 => [
            'id' => 222,'name' => '堂主','desc' => '堂主，大小也算是个干部了','type' => 1,
        ],
        22 => [
            'id' => 223,'name' => '长老','desc' => '长老，帮会中层，有望更上一层','type' => 1,
        ],
        23 => [
            'id' => 224,'name' => '右护法','desc' => '右护法，帮会高层，参与帮务管理','type' => 1,
        ],
        24 => [
            'id' => 225,'name' => '左护法','desc' => '左护法，帮会高层，参与帮务管理','type' => 1,
        ],
        25 => [
            'id' => 226,'name' => '副帮主','desc' => '副帮主，一人之上，万人之下','type' => 1,
        ],
	    26 => [
            'id' => 227,'name' => '帮主','desc' => '帮主，帮会上下，唯吾独尊','type' => 1,
        ]
    ]
];