<?php
/**
 * 充值记录控制器
 */

namespace app\admin\controller;

use think\Request;
use think\Db;

class GameLogController extends Controller
{

    //列表
    public function index(Request $request)
    {
        $param = $request->param();
        $day = isset($param['day']) ? $param['day'] : date("Ymd");

        $modem = Db::table('game_log.'.$day)->alias('a')->scope('where', $param)->field('a.*,b.accountid,b.name,c.account')
        ->join('jianghu.qy_role b', 'a.roleid=b.roleid')
        ->join('jianghu.qy_account c', 'b.accountid=c.accountid');


        if(!empty($param['type'])){
            $modem->where('a.type', $param['type']);
        }
        if(!empty($param['_keywords'])){
            $modem->where('c.account', $param['_keywords'])->whereOr('b.name', 'like', "%{$param['_keywords']}%");
        }

        $data = $modem->paginate($this->admin['per_page'], false, ['query' => $request->get()]);
        //print_r($modem->getLastSQL());

        $this->assign($request->get());


        $this->assign([
            'data' => $data,
            'type' => !empty($param['type']) ? $param['type'] : null,
            'day' => $day,
            'page' => $data->render(),
            'total' => $data->total(),
            'type_val_name' => $this->getTypeValName(!empty($param['type']) ? $param['type'] : null),
            'val_name' => $this->getValName(!empty($param['type']) ? $param['type'] : null),
            'type_name' => $this->getTypeName(),
            'item_data' => $this->itemData(),
            'serv_list' => \app\common\model\GameGm::getServList(),
        ]);

        return $this->fetch();
    }

    private function getTypeName(){

        return [
            1 => '添加物品',
            3 => '添加经验',
            4 => '添加货币',
            5 => '添加装备',
            6 => '添加宠物',
            8 => '删除宠物',
            9 => '使用物品',
            10 => '升级装备',
            11 => '获得装备',
            12 => '删除装备',
            13 => '神兵升级',
            14 => '一键分解',
            15 => '宝石镶嵌',
            16 => '装备炼化',
            17 => '道具分解',
            18 => '佩饰重铸',
        ];

    }

    private function getValName($type){

        switch($type){

        }



        return [];
    }

    private function getTypeValName($type){

        switch($type){
            case '1':
                return ['物品ID', '数量'];
            case '3':
                return ['经验'];
            case '4':
                return ['类型', '数量'];
            case '5': //addEquip
                return ['装备ID'];
            case '6': //createPet
                return ['宠物ID'];
            case '8': //delPet
                return ['宠物ID'];
            case '9': //useItem
                return ['物品ID'];
            case '10': //upgradeEquip
                return ['装备ID', '装备模板'];
            case '11': //createEquip
                return ['装备类型', '装备模板'];
            case '12': //delEquip
                return ['装备ID'];
            case '13': //shenbignUpgrade
                return ['装备类型', '装备模板'];
            case '15': //equipInlay
                return ['装备ID', '宝石ID'];
            case '16': //equipRefine
                return ['装备ID'];
            case '17': //itemResolve
                return ['物品ID'];
            case '18': //baldricRecast
                return ['配饰ID'];
        }

        return [];
    }


    private function itemData(){
        return [
            10001 => "引妖香", 10002 => "百里香", 10003 => "夺命香",
            10004 => "大盘引妖香", 10101 => "普通技能书残卷", 10102 => "高级技能书残卷",
            10103 => "终极技能书残卷", 10110 => "超级神兽丹", 10111 => "亲密丹",
            10112 => "灵兽丹", 10113 => "圣兽丹", 10114 => "神兽丹",
            10115 => "聚魂丹", 10116 => "凝魂丹", 10117 => "龙之骨",
            10118 => "金柳露", 10119 => "召唤兽驯养令", 10120 => "高级亲密丹",
            10201 => "回梦丹", 10202 => "伙伴修炼册", 10203 => "超级星梦石",
            10204 => "超级伙伴修炼册", 10205 => "世界铃铛", 10206 => "超级亲密丹",
            10301 => "见闻录上篇", 10302 => "见闻录中篇", 10303 => "见闻录下篇",
            10401 => "悔梦石", 10402 => "低九彩云龙珠", 10403 => "中九彩云龙珠",
            10404 => "高九彩云龙珠", 10405 => "盘古精铁", 10406 => "八荒遗风",
            10407 => "补天神石", 10408 => "神兵碎片", 10409 => "玉符",
            10501 => "河蚌元气丹", 10502 => "海龟元气丹", 10503 => "松鼠元气丹",
            10504 => "小黄金兽元气丹", 10505 => "小熊元气丹", 10506 => "小豹子元气丹",
            10507 => "小鹿元气丹", 10508 => "小黑熊元气丹", 10509 => "猴小兵元气丹",
            10520 => "雷鸟元气丹", 10521 => "龟丞相元气丹", 10522 => "水灵仙元气丹",
            10523 => "金不换元气丹", 10524 => "当康元气丹", 10525 => "黄金兽元气丹",
            10526 => "冰雪魔元气丹", 10527 => "泥石怪元气丹", 10528 => "剑精灵元气丹",
            10529 => "冥灵妃子元气丹", 10530 => "精卫元气丹", 10531 => "蝴蝶仙子元气丹",
            10532 => "狮蝎元气丹", 10533 => "火神女娲元气丹", 10534 => "喷火牛元气丹",
            10535 => "麒麟元气丹", 10536 => "猴精元气丹", 10537 => "独眼巨人元气丹",
            10538 => "神灵元气丹", 10539 => "舍身女娲元气丹", 10540 => "花妖元气丹",
            10541 => "蟹将元气丹", 10542 => "金刚仙元气丹", 10543 => "伽罗楼王元气丹",
            10550 => "凤凰元气丹", 10551 => "龙马元气丹", 10552 => "苍凛元气丹",
            10553 => "吉祥果元气丹", 10554 => "九戒元气丹", 10555 => "天龙女元气丹",
            10556 => "罗刹鬼姬元气丹", 10557 => "战神女娲元气丹", 10558 => "铁扇公主元气丹",
            10570 => "孔雀明王元气丹", 10571 => "五叶元气丹", 10572 => "浪淘沙元气丹",
            10573 => "颜如玉元气丹", 10574 => "范式之魂元气丹", 10575 => "垂云叟元气丹",
            10576 => "年元气丹", 10577 => "白泽元气丹", 10578 => "画中仙元气丹",
            10579 => "念元气丹", 10580 => "白虎元气丹", 10581 => "青龙元气丹",
            10582 => "朱雀元气丹", 10583 => "玄武元气丹", 10584 => "红孩儿元气丹",
            10585 => "小仙女元气丹", 10586 => "雪人元气丹", 10587 => "狐小妖元气丹",
            10588 => "鸡驴元气丹", 10589 => "上古白虎元气丹", 10590 => "天龙马元气丹",
            10601 => "普通元气丹", 10602 => "高级元气丹", 10603 => "特殊元气丹",
            10604 => "神兽元气丹", 10605 => "坐骑修炼丹", 10606 => "筋骨提气丸",
            10607 => "丹书密券", 10608 => "净瓶玉露", 10609 => "超级坐骑修炼丹",
            10610 => "超级元气丹", 20001 => "火之书", 20002 => "木之书",
            20003 => "水之书", 20004 => "土之书", 20005 => "金之书",
            20006 => "离火之精", 20007 => "巺木之精", 20008 => "坎水之精",
            20009 => "艮土之精", 20010 => "兑金之精", 20011 => "烈焰神珠",
            20012 => "巨木神珠", 20013 => "沧海神珠", 20014 => "混沌神珠",
            20015 => "金铭神珠", 21011 => "四级烈焰神珠", 21012 => "四级巨木神珠",
            21013 => "四级沧海神珠", 21014 => "四级混沌神珠", 21015 => "四级金铭神珠",
            30001 => "1级紫宝石", 30002 => "2级紫宝石", 30003 => "3级紫宝石",
            30004 => "4级紫宝石", 30005 => "5级紫宝石", 30006 => "6级紫宝石",
            30007 => "1级橙宝石", 30008 => "2级橙宝石", 30009 => "3级橙宝石",
            30010 => "4级橙宝石", 30011 => "5级橙宝石", 30012 => "6级橙宝石",
            30013 => "1级绿宝石", 30014 => "2级绿宝石", 30015 => "3级绿宝石",
            30016 => "4级绿宝石", 30017 => "5级绿宝石", 30018 => "6级绿宝石",
            30019 => "1级蓝宝石", 30020 => "2级蓝宝石", 30021 => "3级蓝宝石",
            30022 => "4级蓝宝石", 30023 => "5级蓝宝石", 30024 => "6级蓝宝石",
            30025 => "1级红宝石", 30026 => "2级红宝石", 30027 => "3级红宝石",
            30028 => "4级红宝石", 30029 => "5级红宝石", 30030 => "6级红宝石",
            30100 => "7级紫宝石", 30101 => "7级橙宝石", 30102 => "7级绿宝石",
            30103 => "7级蓝宝石", 30104 => "7级红宝石", 40001 => "白薇雪莲丸",
            40002 => "七宝幻真丸", 40003 => "佩兰玄参丸", 40004 => "珍珠水泽丸",
            40005 => "风水混元丹", 40006 => "灵翼天香", 40007 => "千年灵花",
            40008 => "血烟石", 40009 => "无常丹", 40010 => "九花玉露丸",
            40011 => "玫瑰仙叶", 40012 => "修罗玉", 40013 => "夜叉石",
            40014 => "海蓝石", 40015 => "杜若无心", 40016 => "红血散",
            40017 => "火眼金睛", 50001 => "藏宝图", 50002 => "藏宝图",
            50003 => "藏宝图", 50004 => "高级藏宝图", 60001 => "帐饮东都",
            60002 => "源泉万斛", 60003 => "神工鬼力", 60004 => "倍道兼行",
            60005 => "蹒跚", 60006 => "高级帐饮东都", 60007 => "高级源泉万斛",
            60008 => "高级神工鬼力", 60009 => "高级倍道兼行", 60010 => "高级蹒跚",
            60011 => "恭行天罚", 60012 => "天罡战气", 60013 => "悬刃",
            60014 => "遗患", 60015 => "闪现", 60016 => "高级闪现",
            60017 => "隐身", 60018 => "炊金馔玉", 60019 => "枯木逢春",
            60020 => "西天净土", 60021 => "如人饮水", 60022 => "风火燎原",
            60023 => "子虚乌有", 60024 => "化无", 60025 => "绝境逢生",
            60026 => "妙手回春", 60027 => "分裂攻击", 60028 => "高级分裂攻击",
            60029 => "分花拂柳", 60030 => "天魔解体", 60031 => "分光化影",
            60032 => "青面獠牙", 60033 => "小楼夜哭", 60034 => "高级天魔解体",
            60035 => "高级分光化影", 60036 => "高级青面獠牙", 60037 => "高级小楼夜哭",
            60038 => "隔山打牛", 60039 => "高级隔山打牛", 60040 => "击其不意",
            60101 => "混乱", 60102 => "封印", 60103 => "幻影如风",
            70001 => "染料", 70002 => "七色花", 70003 => "浣彩露",
            80001 => "一箱银币", 90001 => "经验转魂魄", 90002 => "经验",
            90003 => "银两", 90004 => "仙玉", 90005 => "衣服(一阶仙器)",
            90006 => "头盔(一阶仙器)", 90007 => "鞋子(一阶仙器)", 90008 => "项链(一阶仙器)",
            90009 => "武器(一阶仙器)", 90010 => "衣服(一级神兵)", 90011 => "头盔(一级神兵)",
            90012 => "鞋子(一级神兵)", 90013 => "项链(一级神兵)", 90014 => "武器(一级神兵)",
            90015 => "小黄金兽", 90016 => "猴小兵", 90017 => "小黑熊",
            90018 => "小鹿", 90019 => "小豹子", 90020 => "河蚌",
            90021 => "小熊", 90022 => "海龟", 90023 => "松鼠",
            90024 => "金刚仙", 90025 => "花妖", 90026 => "蟹将",
            90027 => "喷火牛", 90028 => "猴精", 90029 => "神灵",
            90030 => "麒麟", 90031 => "舍身女娲", 90032 => "火神女娲",
            90033 => "独眼巨人", 90034 => "蝴蝶仙子", 90035 => "雷鸟",
            90036 => "龟丞相", 90037 => "精卫", 90038 => "伽罗楼王",
            90039 => "狮蝎", 90040 => "冥灵妃子", 90041 => "剑精灵",
            90042 => "泥石怪", 90043 => "冰雪魔", 90044 => "黄金兽",
            90045 => "当康", 90046 => "金不换", 90047 => "水灵仙",
            90048 => "罗刹鬼姬", 90049 => "战神女娲", 90050 => "铁扇公主",
            90051 => "天龙女", 90052 => "九戒", 90053 => "吉祥果",
            90054 => "苍凛", 90055 => "龙马", 90056 => "凤凰",
            90057 => "念", 90058 => "垂云叟", 90059 => "范式之魂",
            90060 => "颜如玉", 90061 => "浪淘沙", 90062 => "五叶",
            90063 => "孔雀明王", 90064 => "画中仙", 90065 => "白泽",
            90066 => "年", 90067 => "白虎", 90068 => "青龙",
            90069 => "朱雀", 90070 => "玄武", 90071 => "红孩儿",
            90072 => "小仙女", 90073 => "雪人", 90074 => "狐小妖",
            90075 => "鸡驴大神", 90076 => "孟极", 90077 => "天龙马",
            90078 => "福犬", 90079 => "赢鱼", 90080 => "神兵",
            90081 => "风伯", 90082 => "永", 90083 => "雨师",
            90084 => "暗夜·影", 91001 => "绑定仙玉", 95001 => "蝉翼",
            95002 => "暗羽", 95003 => "吉光", 95004 => "幽冥",
            95010 => "太上仙羽", 95011 => "幻化蝶翼", 95012 => "流光陵光",
            95013 => "云霞金缕", 95014 => "天下无双", 95015 => "金鳞化龙",
            95016 => "紫云盖地", 95017 => "摄魂披风", 95018 => "摄魂挂件",
            95019 => "摄魂腰带", 95020 => "摄魂戒指・左", 95021 => "摄魂戒指・右",
            95022 => "摄魂披风", 95023 => "摄魂挂件", 95024 => "摄魂腰带",
            95025 => "摄魂戒指・左", 95026 => "摄魂戒指・右", 95027 => "摄魂披风",
            95028 => "摄魂挂件", 95029 => "摄魂腰带", 95030 => "摄魂戒指・左",
            95031 => "摄魂戒指・右", 95032 => "幻影披风", 95033 => "幻影挂件",
            95034 => "幻影腰带", 95035 => "幻影戒指・左", 95036 => "幻影戒指・右",
            95037 => "幻影披风", 95038 => "幻影挂件", 95039 => "幻影腰带",
            95040 => "幻影戒指・左", 95041 => "幻影戒指・右", 95042 => "幻影披风",
            95043 => "幻影挂件", 95044 => "幻影腰带", 95045 => "幻影戒指・左",
            95046 => "幻影戒指・右", 95047 => "相柳披风", 95048 => "相柳挂件",
            95049 => "相柳腰带", 95050 => "相柳戒指・左", 95051 => "相柳戒指・右",
            95052 => "相柳披风", 95053 => "相柳挂件", 95054 => "相柳腰带",
            95055 => "相柳戒指・左", 95056 => "相柳戒指・右", 95057 => "相柳披风",
            95058 => "相柳挂件", 95059 => "相柳腰带", 95060 => "相柳戒指・左",
            95061 => "相柳戒指・右", 95062 => "龙殇披风", 95063 => "龙殇挂件",
            95064 => "龙殇腰带", 95065 => "龙殇戒指・左", 95066 => "龙殇戒指・右",
            95067 => "龙殇披风", 95068 => "龙殇挂件", 95069 => "龙殇腰带",
            95070 => "龙殇戒指・左", 95071 => "龙殇戒指・右", 95072 => "龙殇披风",
            95073 => "龙殇挂件", 95074 => "龙殇腰带", 95075 => "龙殇戒指・左",
            95076 => "龙殇戒指・右", 95077 => "龙殇披风", 95078 => "龙殇挂件",
            95079 => "龙殇腰带", 95080 => "龙殇戒指・左", 95081 => "龙殇戒指・右",
            95082 => "龙殇披风", 95083 => "龙殇挂件", 95084 => "龙殇腰带",
            95085 => "龙殇戒指・左", 95086 => "龙殇戒指・右", 95087 => "龙殇披风",
            95088 => "龙殇挂件", 95089 => "龙殇腰带", 95090 => "龙殇戒指・左",
            95091 => "龙殇戒指・右", 95092 => "罗睺披风", 95093 => "罗睺挂件",
            95094 => "罗睺腰带", 95095 => "罗睺戒指・左", 95096 => "罗睺戒指・右",
            95097 => "罗睺披风", 95098 => "罗睺挂件", 95099 => "罗睺腰带",
            95100 => "罗睺戒指・左", 95101 => "罗睺戒指・右", 95102 => "罗睺披风",
            95103 => "罗睺挂件", 95104 => "罗睺腰带", 95105 => "罗睺戒指・左",
            95106 => "罗睺戒指・右", 95107 => "残梦披风", 95108 => "残梦挂件",
            95109 => "残梦腰带", 95110 => "残梦戒指・左", 95111 => "残梦戒指・右",
            95112 => "残梦披风", 95113 => "残梦挂件", 95114 => "残梦腰带",
            95115 => "残梦戒指・左", 95116 => "残梦戒指・右", 95117 => "残梦披风",
            95118 => "残梦挂件", 95119 => "残梦腰带", 95120 => "残梦戒指・左",
            95121 => "残梦戒指・右", 95122 => "幽影披风", 95123 => "幽影挂件",
            95124 => "幽影腰带", 95125 => "幽影戒指・左", 95126 => "幽影戒指・右",
            95127 => "幽影披风", 95128 => "幽影挂件", 95129 => "幽影腰带",
            95130 => "幽影戒指・左", 95131 => "幽影戒指・右", 95132 => "幽影披风",
            95133 => "幽影挂件", 95134 => "幽影腰带", 95135 => "幽影戒指・左",
            95136 => "幽影戒指・右", 95137 => "断鬼披风", 95138 => "断鬼挂件",
            95139 => "断鬼腰带", 95140 => "断鬼戒指・左", 95141 => "断鬼戒指・右",
            95142 => "断鬼披风", 95143 => "断鬼挂件", 95144 => "断鬼腰带",
            95145 => "断鬼戒指・左", 95146 => "断鬼戒指・右", 95147 => "断鬼披风",
            95148 => "断鬼挂件", 95149 => "断鬼腰带", 95150 => "断鬼戒指・左",
            95151 => "断鬼戒指・右", 95152 => "战意披风", 95153 => "战意挂件",
            95154 => "战意腰带", 95155 => "战意戒指・左", 95156 => "战意戒指・右",
            95157 => "天威披风", 95158 => "天威挂件", 95159 => "天威腰带",
            95160 => "天威戒指・左", 95161 => "天威戒指・右", 95162 => "青阳披风",
            95163 => "青阳挂件", 95164 => "青阳腰带", 95165 => "青阳戒指・左",
            95166 => "青阳戒指・右", 95167 => "战意披风", 95168 => "战意挂件",
            95169 => "战意腰带", 95170 => "战意戒指・左", 95171 => "战意戒指・右",
            95172 => "天威披风", 95173 => "天威挂件", 95174 => "天威腰带",
            95175 => "天威戒指・左", 95176 => "天威戒指・右", 95177 => "青阳披风",
            95178 => "青阳挂件", 95179 => "青阳腰带", 95180 => "青阳戒指・左",
            95181 => "青阳戒指・右", 95182 => "沧海披风", 95183 => "沧海挂件",
            95184 => "沧海腰带", 95185 => "沧海戒指・左", 95186 => "沧海戒指・右",
            95187 => "战意披风", 95188 => "战意挂件", 95189 => "战意腰带",
            95190 => "战意戒指・左", 95191 => "战意戒指・右", 95192 => "天威披风",
            95193 => "天威挂件", 95194 => "天威腰带", 95195 => "天威戒指・左",
            95196 => "天威戒指・右", 95197 => "青阳披风", 95198 => "青阳挂件",
            95199 => "青阳腰带", 95200 => "青阳戒指・左", 95201 => "青阳戒指・右",
            95202 => "沧海披风", 95203 => "沧海挂件", 95204 => "沧海腰带",
            95205 => "沧海戒指・左", 95206 => "沧海戒指・右", 95207 => "沧海披风",
            95208 => "沧海挂件", 95209 => "沧海腰带", 95210 => "沧海戒指・左",
            95211 => "沧海戒指・右",    
        ];
    }






}
